Mysteo91/stm32-periph-utils/lib/uartCircularHw/src/user_layer/uart.c
//
// Created by user on 07.05.2025.
//
#include "uart.h"
#include "uart_gpio_check.h"
#include <string.h>
#include "stm32h5xx_hal.h"


typedef enum {
    DMA_USING_FOR_NONE,
    DMA_USING_FOR_RX,
    DMA_USING_FOR_TX

}DMA_USING_FOR_Enum;

typedef struct {
    DMA_HandleTypeDef  dmaHandleRx;
    DMA_HandleTypeDef  dmaHandleTx;
    DMA_NodeTypeDef    nodeRx;
    DMA_QListTypeDef   listRx;
}dma_t;

typedef struct
{
    UART_HandleTypeDef huart;
    uint8_t* lastWrtPnt;
    uint8_t countOverflowed;
    dma_t dma;
    void  (*userRxCallback)(uint8_t* dataStartAddress, uint8_t* dataContinuesAddress, uint16_t dataLen, uint16_t dataContinuesLen);

}uart_t;

#ifdef UART1_HW
uart_t uart1 = {
    .huart.Instance = USART1,
    .huart.Init = {
            .Mode = UART1_HW_MODE,
            .HwFlowCtl = UART1_HW_FLOW_CONTROL
    },
#ifdef UART1_HW_DMA_RX_CHANNEL
    .dma.dmaHandleRx = {
        .Instance = (DMA_Channel_TypeDef *) UART1_HW_DMA_RX_CHANNEL,
        #ifdef UART1_HW_CIRCULAR
        .Init.Mode = DMA_LINKEDLIST_CIRCULAR
        #else
        .Init.Mode = DMA_NORMAL
        #endif
    },
#endif

#ifdef UART1_HW_DMA_TX_CHANNEL
    .dma.dmaHandleTx = {
        .Instance = (DMA_Channel_TypeDef *) UART1_HW_DMA_TX_CHANNEL
    },
#endif
};
#endif

#ifdef UART2_HW
uart_t uart2 = {
    .huart.Instance = USART2,
    .huart.Init = {
        .Mode = UART2_HW_MODE,
        .HwFlowCtl =  UART2_HW_FLOW_CONTROL
    },
#ifdef UART2_HW_DMA_RX_CHANNEL
    .dma.dmaHandleRx = {
        .Instance = (DMA_Channel_TypeDef *) UART2_HW_DMA_RX_CHANNEL,
        #ifdef UART2_HW_CIRCULAR
        .Init.Mode = DMA_LINKEDLIST_CIRCULAR
        #else
        .Init.Mode = DMA_NORMAL
        #endif

    },

#endif
#ifdef UART2_HW_DMA_TX_CHANNEL
    .dma.dmaHandleTx = {
        .Instance = (DMA_Channel_TypeDef *) UART2_HW_DMA_TX_CHANNEL
    },
#endif
};
#endif

#ifdef UART3_HW
uart_t uart3 = {

    .huart.Instance = USART3,
    .huart.Init = {
        .Mode = UART3_HW_MODE,
        .HwFlowCtl = UART3_HW_FLOW_CONTROL
    },
#ifdef UART3_HW_DMA_RX_CHANNEL
    .dma.dmaHandleRx = {
        .Instance = (DMA_Channel_TypeDef *) UART3_HW_DMA_RX_CHANNEL,
        #ifdef UART3_HW_CIRCULAR
        .Init.Mode = DMA_LINKEDLIST_CIRCULAR
        #else
        .Init.Mode = DMA_NORMAL
        #endif
    },
#endif
#ifdef UART3_HW_DMA_TX_CHANNEL
    .dma.dmaHandleTx = {
        .Instance = (DMA_Channel_TypeDef *) UART3_HW_DMA_TX_CHANNEL
    },
#endif

};
#endif

#ifdef UART4_HW
uart_t uart4 = {
    .huart.Instance = USART4,
    .huart.Init = {
        .Mode = UART4_HW_MODE,
        .HwFlowCtl = UART4_HW_FLOW_CONTROL
    },
#ifdef UART4_HW_DMA_RX_CHANNEL
    .dma.dmaHandleRx = {
        .Instance = (DMA_Channel_TypeDef *) UART4_HW_DMA_RX_CHANNEL,
        #ifdef UART4_HW_CIRCULAR
        .Init.Mode = DMA_LINKEDLIST_CIRCULAR
        #else
        .Init.Mode = DMA_NORMAL
        #endif
    },
#endif
#ifdef UART4_HW_DMA_TX_CHANNEL
    .dma.dmaHandleTx = {
        .Instance = (DMA_Channel_TypeDef *) UART4_HW_DMA_TX_CHANNEL
    },
#endif
};
#endif

#ifdef UART5_HW
uart_t uart5 = {
    .huart.Instance = UART5,
    .huart.Init = {
        .Mode = UART5_HW_MODE,
        .HwFlowCtl = UART5_HW_FLOW_CONTROL
    },
#ifdef UART5_HW_DMA_RX_CHANNEL
    .dma.dmaHandleRx = {
        .Instance = (DMA_Channel_TypeDef *) UART5_HW_DMA_RX_CHANNEL,
        #ifdef UART5_HW_CIRCULAR
        .Init.Mode = DMA_LINKEDLIST_CIRCULAR
        #else
        .Init.Mode = DMA_NORMAL
        #endif
    },
#endif
#ifdef UART5_HW_DMA_TX_CHANNEL
    .dma.dmaHandleTx = {
        .Instance = (DMA_Channel_TypeDef *) UART5_HW_DMA_TX_CHANNEL
    },
#endif
};
#endif

#ifdef UART6_HW
uart_t uart6 = {
    .huart.Instance = USART6,
    .huart.Init = {
        .Mode = UART2_HW_MODE,
        .HwFlowCtl = UART6_HW_FLOW_CONTROL
    },
#ifdef UART6_HW_DMA_RX_CHANNEL
    .dma.dmaHandleRx = {
        .Instance =  (DMA_Channel_TypeDef *) UART6_HW_DMA_RX_CHANNEL,
        #ifdef UART6_HW_CIRCULAR
        .Init.Mode = DMA_LINKEDLIST_CIRCULAR
        #else
        .Init.Mode = DMA_NORMAL
        #endif
    },
#endif
#ifdef UART6_HW_DMA_TX_CHANNEL
    .dma.dmaHandleTx = {
        .Instance = (DMA_Channel_TypeDef *) UART6_HW_DMA_TX_CHANNEL
    },
#endif
};
#endif



static void deinitUart(uart_t *uart);
static void enableClkGPIO(GPIO_TypeDef *port);
static void initUartGPIO(GPIO_TypeDef *port, uint32_t pin, uint8_t alternateFunction, uint8_t gpioSpeed);
static void initDmaForUART(DMA_HandleTypeDef *dmaHandle, uint32_t DMA_REQUEST, uint32_t DMA_CCR);
static void initDmaCircularForUART(DMA_HandleTypeDef *dmaHandle, uint32_t DMA_REQUEST, uint32_t DMA_CCR);
static void setPriorityDMA(DMA_Channel_TypeDef* dmaChannel, uint8_t priority);
DMA_HandleTypeDef* getDMAHalHandleByDMA (DMA_Channel_TypeDef *dma);

UART_HandleTypeDef *getUartHalHandleByUSART(USART_TypeDef *usart) {

#ifdef UART1_HW
    if (uart1.huart.Instance == usart) {
        return &uart1.huart;
    }
#endif
#ifdef UART2_HW
    if (uart2.huart.Instance == usart) {
        return &uart2.huart;
    }
#endif
#ifdef UART3_HW
    if (uart3.huart.Instance == usart) {
        return &uart3.huart;
    }
#endif
#ifdef UART4_HW
    if (uart4.huart.Instance == usart) {
        return &uart4.huart;
    }
#endif
#ifdef UART5_HW
    if (uart5.huart.Instance == usart) {
        return &uart5.huart;
    }
#endif
#ifdef UART6_HW
    if (uart6.huart.Instance == usart) {
        return &uart6.huart;
    }
#endif

    return NULL;
}

static UART_HandleTypeDef* getUartHalHandleByDMA (DMA_Channel_TypeDef *dma) {

#ifdef UART1_HW
    if(uart1.dma.dmaHandleRx.Instance == dma) {
        return &uart1.huart;
    }
    if (uart1.dma.dmaHandleTx.Instance == dma) {
        return &uart1.huart;
    }
#endif
#ifdef UART2_HW
    if(uart2.dma.dmaHandleRx.Instance == dma) {
        return &uart2.huart;
    }
    if (uart2.dma.dmaHandleTx.Instance == dma) {
        return &uart2.huart;
    }
#endif
#ifdef UART3_HW
    if(uart3.dma.dmaHandleRx.Instance == dma) {
        return &uart3.huart;
    }
    if (uart3.dma.dmaHandleTx.Instance == dma) {
        return &uart3.huart;
    }
#endif
#ifdef UART4_HW
    if(uart4.dma.dmaHandleRx.Instance == dma) {
        return &uart4.huart;
    }
    if (uart4.dma.dmaHandleTx.Instance == dma) {
        return &uart4.huart;
    }
#endif
#ifdef UART5_HW
    if(uart5.dma.dmaHandleRx.Instance == dma) {
        return &uart5.huart;
    }
    if (uart5.dma.dmaHandleTx.Instance == dma) {
        return &uart5.huart;
    }
#endif
#ifdef UART6_HW
    if(uart6.dma.dmaHandleRx.Instance == dma) {
        return &uart6.huart;
    }
    if (uart6.dma.dmaHandleTx.Instance == dma) {
        return &uart6.huart;
    }
#endif
    while (1) {
        //@todo ERROR_HANDLER for debug only
    }
}

DMA_HandleTypeDef* getDMAHalHandleByDMA (DMA_Channel_TypeDef *dma) {

#ifdef UART1_HW_DMA_RX_CHANNEL
    if(uart1.dma.dmaHandleRx.Instance == dma) {
        return &uart1.dma.dmaHandleRx;
    }
#endif

