Mysteo91/stm32-periph-utils/lib/uartCircularHw/src/user_layer/uart.c
#ifdef UART2_HW_DMA_RX_CHANNEL
    if(uart2.dma.dmaHandleRx.Instance == dma) {
        return &uart2.dma.dmaHandleRx;
    }
#endif

#ifdef UART3_HW_DMA_RX_CHANNEL
        if(uart3.dma.dmaHandleRx.Instance == dma) {
            return &uart3.dma.dmaHandleRx;
        }
#endif

#ifdef UART4_HW_DMA_RX_CHANNEL
        if(uart4.dma.dmaHandleRx.Instance == dma) {
            return &uart4.dma.dmaHandleRx;
        }
#endif

#ifdef UART5_HW_DMA_RX_CHANNEL
        if(uart5.dma.dmaHandleRx.Instance == dma) {
            return &uart5.dma.dmaHandleRx;
        }
#endif

#ifdef UART6_HW_DMA_RX_CHANNEL
        if(uart6.dma.dmaHandleRx.Instance == dma) {
            return &uart6.dma.dmaHandleRx;
        }
#endif

#ifdef UART1_HW_DMA_TX_CHANNEL
    if(uart1.dma.dmaHandleTx.Instance == dma) {
        return &uart1.dma.dmaHandleTx;
    }
#endif

#ifdef UART2_HW_DMA_TX_CHANNEL
    if(uart2.dma.dmaHandleTx.Instance == dma) {
        return &uart2.dma.dmaHandleTx;
    }
#endif

#ifdef UART3_HW_DMA_TX_CHANNEL
    if(uart3.dma.dmaHandleTx.Instance == dma) {
        return &uart3.dma.dmaHandleTx;
    }
#endif

#ifdef UART4_HW_DMA_TX_CHANNEL
    if(uart4.dma.dmaHandleTx.Instance == dma) {
        return &uart4.dma.dmaHandleTx;
    }
#endif

#ifdef UART5_HW_DMA_TX_CHANNEL
    if(uart5.dma.dmaHandleTx.Instance == dma) {
        return &uart5.dma.dmaHandleTx;
    }
#endif

#ifdef UART6_HW_DMA_TX_CHANNEL
    if(uart6.dma.dmaHandleTx.Instance == dma) {
        return &uart6.dma.dmaHandleTx;
    }
#endif

    while (1) {
        //@todo ERROR_HANDLER for debug only
    }
}



static DMA_USING_FOR_Enum dmaUsingFor(DMA_Channel_TypeDef *dma) {

#ifdef UART1_HW
    if(uart1.dma.dmaHandleRx.Instance == dma) {
        return DMA_USING_FOR_RX;
    }
    if (uart1.dma.dmaHandleTx.Instance == dma) {
        return DMA_USING_FOR_TX;
    }
#endif
#ifdef UART2_HW
    if(uart2.dma.dmaHandleRx.Instance == dma) {
        return DMA_USING_FOR_RX;
    }
    if (uart2.dma.dmaHandleTx.Instance == dma) {
        return DMA_USING_FOR_TX;
    }
#endif
#ifdef UART3_HW
    if(uart3.dma.dmaHandleRx.Instance == dma) {
        return DMA_USING_FOR_RX;
    }
    if (uart3.dma.dmaHandleTx.Instance == dma) {
        return DMA_USING_FOR_TX;
    }
#endif
#ifdef UART4_HW
    if(uart4.dma.dmaHandleRx.Instance == dma) {
        return DMA_USING_FOR_RX;
    }
    if (uart4.dma.dmaHandleTx.Instance == dma) {
        return DMA_USING_FOR_TX;
    }
#endif
#ifdef UART5_HW
    if(uart5.dma.dmaHandleRx.Instance == dma) {
        return DMA_USING_FOR_RX;
    }
    if (uart5.dma.dmaHandleTx.Instance == dma) {
        return DMA_USING_FOR_TX;
    }
#endif
#ifdef UART6_HW
    if(uart6.dma.dmaHandleRx.Instance == dma) {
        return DMA_USING_FOR_RX;
    }
    if (uart6.dma.dmaHandleTx.Instance == dma) {
        return DMA_USING_FOR_TX;
    }
#endif
    return DMA_USING_FOR_NONE;

}


static uart_t *getUartByHalHandle(UART_HandleTypeDef *huart) {
#ifdef UART1_HW
    if (&uart1.huart == huart) {
        return &uart1;
    }
#endif
#ifdef UART2_HW
    if (&uart2.huart == huart) {
        return &uart2;
    }
#endif
#ifdef UART3_HW
    if (&uart3.huart == huart) {
        return &uart3;
    }
#endif
#ifdef UART4_HW
    if (&uart4.huart == huart) {
        return &uart4;
    }
#endif
#ifdef UART5_HW
    if (&uart5.huart == huart) {
        return &uart5;
    }
#endif
#ifdef UART6_HW
    if (&uart6.huart == huart) {
        return &uart6;
    }
#endif
    while (1) {
        //@todo ERROR_HANDLER for debug only
    }
}


bool uartStartReceive(USART_TypeDef *usart, const uint8_t* dst, uint16_t size)
{
    UART_HandleTypeDef* huart = getUartHalHandleByUSART(usart);
    HAL_UARTEx_ReceiveToIdle_DMA(huart, dst, size );
}


bool uartInit(USART_TypeDef *usart, uint32_t baudrate, const
                uint8_t NVIC_Priority) {
    UART_HandleTypeDef* huart = getUartHalHandleByUSART(usart);
    if (huart == NULL) {
        return false;
    }
    uart_t* uart = getUartByHalHandle(huart);
    huart->Instance = usart;
    huart->Init.BaudRate = baudrate;
    huart->Init.WordLength = UART_WORDLENGTH_8B;
    huart->Init.StopBits = UART_STOPBITS_1;
    huart->Init.Parity = UART_PARITY_NONE;
    huart->Init.Mode = UART_MODE_TX_RX;
    huart->Init.OverSampling = UART_OVERSAMPLING_16;
    huart->Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    huart->Init.ClockPrescaler = UART_PRESCALER_DIV1;
    huart->AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
    if (HAL_UART_Init(huart) != HAL_OK) {
        return false;
    }
    if (HAL_UARTEx_SetTxFifoThreshold(huart, UART_TXFIFO_THRESHOLD_1_8) != HAL_OK) {
        return false;
    }
    if (HAL_UARTEx_SetRxFifoThreshold(huart, UART_RXFIFO_THRESHOLD_1_8) != HAL_OK) {
        return false;
    }
    if (HAL_UARTEx_DisableFifoMode(huart) != HAL_OK) {
        return false;
    }


    if (usart == USART1) {
        HAL_NVIC_EnableIRQ(USART1_IRQn);
        HAL_NVIC_SetPriority(USART1_IRQn, NVIC_Priority, 0);
    }
    else if (usart == USART2) {
        HAL_NVIC_EnableIRQ(USART2_IRQn);
        HAL_NVIC_SetPriority(USART2_IRQn, NVIC_Priority, 0);
    }
    else if (usart == USART3) {
        HAL_NVIC_EnableIRQ(USART3_IRQn);
        HAL_NVIC_SetPriority(USART3_IRQn, NVIC_Priority, 0);
    }
    else if (usart == UART4) {
        HAL_NVIC_EnableIRQ(UART4_IRQn);
        HAL_NVIC_SetPriority(UART4_IRQn, NVIC_Priority, 0);
    }
    else if (usart == UART5) {
        HAL_NVIC_EnableIRQ(UART5_IRQn);
        HAL_NVIC_SetPriority(UART5_IRQn, NVIC_Priority, 0);
    }
    else if (usart == USART6) {
        HAL_NVIC_EnableIRQ(USART6_IRQn);
        HAL_NVIC_SetPriority(USART6_IRQn, NVIC_Priority, 0);
    }

    if (uart->dma.dmaHandleRx.Instance != NULL)
        setPriorityDMA(uart->dma.dmaHandleRx.Instance, NVIC_Priority);
    if (uart->dma.dmaHandleTx.Instance != NULL)
        setPriorityDMA(uart->dma.dmaHandleTx.Instance, NVIC_Priority);

    return true;
}

bool uartSetDMAPriority(USART_TypeDef *usart, uint32_t DMA_CCR) {

    UART_HandleTypeDef* huart = getUartHalHandleByUSART(usart);
    if (huart == NULL) {
        return false;
    }
    uart_t* uart = getUartByHalHandle(huart);
    if (huart->hdmarx != NULL) {
        if (huart->hdmarx->State != HAL_UART_STATE_RESET) {
            if ( HAL_DMA_DeInit(huart->hdmarx) != HAL_OK ) {
                return false;
            }
        }
    }
    if (uart->dma.dmaHandleRx.InitLinkedList.LinkedListMode == DMA_LINKEDLIST_CIRCULAR) {
        uart->dma.dmaHandleRx.InitLinkedList.Priority = DMA_CCR;
        HAL_DMAEx_List_Init(&uart->dma.dmaHandleRx);
    }
    else {
        uart->dma.dmaHandleRx.Init.Priority = DMA_CCR;
        HAL_DMA_Init(&uart->dma.dmaHandleRx);
    }

