Mysteo91/stm32-periph-utils/lib/uartCircularHw/src/user_layer/uart.c
}

void HAL_UART_MspInit(UART_HandleTypeDef *huart) {


#ifdef UART1_HW
    if (huart->Instance == USART1) {
        __HAL_RCC_USART1_CLK_ENABLE();

#ifdef UART1_HW_RX_PIN
        enableClkGPIO((GPIO_TypeDef *)UART1_HW_RX_PORT);
        initUartGPIO((GPIO_TypeDef *)UART1_HW_RX_PORT, UART1_HW_RX_PIN, UART1_HW_RX_ALTERNATE_FUNC, GPIO_SPEED_FREQ_LOW);
#ifdef UART1_HW_CIRCULAR

#else

#endif
#endif

#ifdef UART1_HW_TX_PIN
        enableClkGPIO((GPIO_TypeDef *)UART1_HW_TX_PORT);
        initUartGPIO((GPIO_TypeDef *)UART1_HW_TX_PORT, UART1_HW_TX_PIN, UART1_HW_TX_ALTERNATE_FUNC, GPIO_SPEED_FREQ_LOW);

#endif

#if UART1_HW_FLOW_CONTROL == (USART_CR3_RTSE | USART_CR3_CTSE)
        enableClkGPIO((GPIO_TypeDef *)UART1_HW_RTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART1_HW_RTS_PORT, UART1_HW_RTS_PIN, UART1_HW_RTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
        enableClkGPIO((GPIO_TypeDef *)UART1_HW_CTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART1_HW_CTS_PORT, UART1_HW_CTS_PIN, UART1_HW_CTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#elif UART1_HW_FLOW_CONTROL == USART_CR3_RTSE
        enableClkGPIO((GPIO_TypeDef *)UART1_HW_CTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART1_HW_CTS_PORT, UART1_HW_CTS_PIN, UART1_HW_CTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#elif UART1_HW_FLOW_CONTROL == USART_CR3_CTSE
        enableClkGPIO((GPIO_TypeDef *)UART1_HW_RTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART1_HW_RTS_PORT, UART1_HW_RTS_PIN, UART1_HW_RTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#endif


    }

    else if (huart->Instance == USART2) {
        __HAL_RCC_USART2_CLK_ENABLE();

#ifdef UART2_HW_RX_PIN
        enableClkGPIO((GPIO_TypeDef *)UART2_HW_RX_PORT);
        initUartGPIO((GPIO_TypeDef *)UART2_HW_RX_PORT, UART2_HW_RX_PIN, UART2_HW_RX_ALTERNATE_FUNC, GPIO_SPEED_FREQ_LOW);
#endif

#ifdef UART2_HW_TX_PIN
        enableClkGPIO((GPIO_TypeDef *)UART2_HW_TX_PORT);
        initUartGPIO((GPIO_TypeDef *)UART2_HW_TX_PORT, UART2_HW_TX_PIN, UART2_HW_TX_ALTERNATE_FUNC, GPIO_SPEED_FREQ_LOW);
#endif

#if UART2_HW_FLOW_CONTROL == (USART_CR3_RTSE | USART_CR3_CTSE)
        enableClkGPIO((GPIO_TypeDef *)UART2_HW_RTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART2_HW_RTS_PORT, UART2_HW_RTS_PIN, UART2_HW_RTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
        enableClkGPIO((GPIO_TypeDef *)UART2_HW_CTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART2_HW_CTS_PORT, UART2_HW_CTS_PIN, UART2_HW_CTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#elif UART2_HW_FLOW_CONTROL == USART_CR3_RTSE
        enableClkGPIO((GPIO_TypeDef *)UART2_HW_CTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART2_HW_CTS_PORT, UART2_HW_CTS_PIN, UART2_HW_CTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#elif UART2_HW_FLOW_CONTROL == USART_CR3_CTSE
        enableClkGPIO((GPIO_TypeDef *)UART2_HW_RTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART2_HW_RTS_PORT, UART2_HW_RTS_PIN, UART2_HW_RTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#endif
    }
    else if (huart->Instance == USART3) {
        __HAL_RCC_USART3_CLK_ENABLE();

#ifdef UART3_HW_RX_PIN
        enableClkGPIO((GPIO_TypeDef *)UART3_HW_RX_PORT);
        initUartGPIO((GPIO_TypeDef *)UART3_HW_RX_PORT, UART3_HW_RX_PIN, UART3_HW_RX_ALTERNATE_FUNC, GPIO_SPEED_FREQ_LOW);
#endif

#ifdef UART3_HW_TX_PIN
        enableClkGPIO((GPIO_TypeDef *)UART3_HW_TX_PORT);
        initUartGPIO((GPIO_TypeDef *)UART3_HW_TX_PORT, UART3_HW_TX_PIN, UART3_HW_TX_ALTERNATE_FUNC, GPIO_SPEED_FREQ_LOW);
#endif

#if UART3_HW_FLOW_CONTROL == (USART_CR3_RTSE | USART_CR3_CTSE)
        enableClkGPIO((GPIO_TypeDef *)UART3_HW_RTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART3_HW_RTS_PORT, UART3_HW_RTS_PIN, UART3_HW_RTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
        enableClkGPIO((GPIO_TypeDef *)UART3_HW_CTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART3_HW_CTS_PORT, UART3_HW_CTS_PIN, UART3_HW_CTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#elif UART3_HW_FLOW_CONTROL == USART_CR3_RTSE
        enableClkGPIO((GPIO_TypeDef *)UART3_HW_CTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART3_HW_CTS_PORT, UART3_HW_CTS_PIN, UART3_HW_CTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#elif UART3_HW_FLOW_CONTROL == USART_CR3_CTSE
        enableClkGPIO((GPIO_TypeDef *)UART3_HW_RTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART3_HW_RTS_PORT, UART3_HW_RTS_PIN, UART3_HW_RTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#endif
    }

    else if (huart->Instance == UART4) {
        __HAL_RCC_UART4_CLK_ENABLE();

#ifdef UART4_HW_RX_PIN
        enableClkGPIO((GPIO_TypeDef *)UART4_HW_RX_PORT);
        initUartGPIO((GPIO_TypeDef *)UART4_HW_RX_PORT, UART4_HW_RX_PIN, UART4_HW_RX_ALTERNATE_FUNC, GPIO_SPEED_FREQ_LOW);
#endif

#ifdef UART4_HW_TX_PIN
        enableClkGPIO((GPIO_TypeDef *)UART4_HW_TX_PORT);
        initUartGPIO((GPIO_TypeDef *)UART4_HW_TX_PORT, UART4_HW_TX_PIN, UART4_HW_TX_ALTERNATE_FUNC, GPIO_SPEED_FREQ_LOW);
#endif

#if UART4_HW_FLOW_CONTROL == (USART_CR3_RTSE | USART_CR3_CTSE)
        enableClkGPIO((GPIO_TypeDef *)UART4_HW_RTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART4_HW_RTS_PORT, UART4_HW_RTS_PIN, UART4_HW_RTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
        enableClkGPIO((GPIO_TypeDef *)UART4_HW_CTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART4_HW_CTS_PORT, UART4_HW_CTS_PIN, UART4_HW_CTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#elif UART4_HW_FLOW_CONTROL == USART_CR3_RTSE
        enableClkGPIO((GPIO_TypeDef *)UART4_HW_CTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART4_HW_CTS_PORT, UART4_HW_CTS_PIN, UART4_HW_CTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#elif UART4_HW_FLOW_CONTROL == USART_CR3_CTSE
        enableClkGPIO((GPIO_TypeDef *)UART4_HW_RTS_PORT);
        initUartGPIO((GPIO_TypeDef *)UART4_HW_RTS_PORT, UART4_HW_RTS_PIN, UART4_HW_RTS_ALTERNATE_FUNC, GPIO_SPEED_FREQ_VERY_HIGH);
#endif
    }
    else if (huart->Instance == UART5) {
        __HAL_RCC_UART5_CLK_ENABLE();

#ifdef UART5_HW_RX_PIN
        enableClkGPIO((GPIO_TypeDef *)UART5_HW_RX_PORT);
        initUartGPIO((GPIO_TypeDef *)UART5_HW_RX_PORT, UART5_HW_RX_PIN, UART5_HW_RX_ALTERNATE_FUNC, GPIO_SPEED_FREQ_LOW);
#endif

#ifdef UART5_HW_TX_PIN
        enableClkGPIO((GPIO_TypeDef *)UART5_HW_TX_PORT);
        enableClkGPIO((GPIO_TypeDef *)UART5_HW_TX_PORT);

